# Пользователь вводит месяц в виде целого числа от 1 до 12.
# Сообщить к какому времени года относится месяц (зима, весна, лето, осень).
# Напишите решения через list и через dict.

month_number = int(input("Введите номер месяца"))
if month_number >= 1 and month_number <= 12:
    # реализация через dict
    season_dict = {1: "зима", 2: "зима", 3: "весна", 4: "весна", 5: "весна", 6: "лето", 7: "лето", 8: "лето", 9: "осень", 10: "осень", 11: "осень", 12: "зима" }
    print("сезон", season_dict[month_number])

    # реализация через list
    season_list = ["зима","зима","весна","весна","весна","лето","лето","лето","осень","осень","осень","зима"]
    print("сезон", season_list[month_number-1])
else:
    print("Введены неверные данные")
